upstream/OpenFOAM-v2606/tutorials/incompressible/pimpleFoam/RAS/propeller/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

if notTest "$@"
then

    ./Allrun.pre

    runApplication decomposePar

    restore0Dir -processor

    runParallel $(getApplication)

    runApplication reconstructPar

fi

#------------------------------------------------------------------------------
